<h3>Pandas</h3> 
<h3></h3>
Pandas is a powerful data manipulation library in python widely use for data analysis and data cleaning. It provides data structures and functions to efficiently handle structured data,data structues here are Seris and DataFrame. A Series is one dimensional array like object, while DataFrame is a two dimensional, size mutable and potentially heterogeneous tabular data structure with labeled axes(rows and columns)

In [2]:
import pandas as pd

In [7]:
s1 = pd.Series([1,2,7,3,23,5,10,19])
s1

0     1
1     2
2     7
3     3
4    23
5     5
6    10
7    19
dtype: int64

In [8]:
print(type(s1))

<class 'pandas.core.series.Series'>

In [9]:
s2 = {'a':23,'b':54,'c':3,'d':90}
s2 = pd.Series(s2)
s2

a    23
b    54
c     3
d    90
dtype: int64

In [11]:
data = [10,20,40,80]
index = ["Namir","Ibaad","Armaan","Shah"]
pd.Series(data,index = index)

Namir     10
Ibaad     20
Armaan    40
Shah      80
dtype: int64

In [14]:
data1 = {
    'Name' : ['Namir','John','Arya','Rob','Ned','Snow','Catlyn'],
    'Age' : [21, 31, 41, 51, 61, 71, 81],
    'Location' : ['USA','UK','Canada','Australia','Germany','France','Spain'],
    'Gender' : ['Male','Female','Male','Male','Male','Male','Female'],
    'Income' : [5000000, 60000, 70000, 80000, 90000,100000,2000000]
    }
data1 = pd.DataFrame(data1)
data1

     Name  Age   Location  Gender   Income
0   Namir   21        USA    Male  5000000
1    John   31         UK  Female    60000
2    Arya   41     Canada    Male    70000
3     Rob   51  Australia    Male    80000
4     Ned   61    Germany    Male    90000
5    Snow   71     France    Male   100000
6  Catlyn   81      Spain  Female  2000000

In [6]:
data2 = [
    {'Name' :'Namir', 'Age': 21, 'Location': 'New York'},
    {'Name': 'jon', 'Age' : 30, 'Location': 'Los Angeles'},
    {'Name': 'John', 'Age': 25, 'Location': 'Chicago'},
    {'Name': 'Stark', 'Age': 27, 'Location': 'Chicago'},
    {'Name': 'Dron', 'Age': 25, 'Location': 'New Jersey'},
]

data2 = pd.DataFrame(data2)
data2

    Name  Age     Location
0  Namir   21     New York
1    jon   30  Los Angeles
2   John   25      Chicago
3  Stark   27      Chicago
4   Dron   25   New Jersey

In [7]:
print(type(data2))

<class 'pandas.core.frame.DataFrame'>

In [8]:
la_data = pd.read_csv('LA_airbnb.csv')

C:\Users\namir\AppData\Local\Temp\ipykernel_8100\391503594.py:1: DtypeWarning: Columns (4) have mixed types. Specify dtype option on import or set low_memory=False.
  la_data = pd.read_csv('LA_airbnb.csv')

In [9]:
la_data

,id,name,host_id,host_name,host_since,host_response_time,host_response_rate,host_is_superhost,neighbourhood_cleansed,neighbourhood_group_cleansed,...,bathrooms,bedrooms,beds,price,minimum_nights,availability_365,number_of_reviews,review_scores_rating,license,instant_bookable
0,670339032744709144,Westwood lovely three bedrooms three bathrooms,4780152,Moon,20/01/13,within a few hours,0.96,f,West Los Angeles,City of Los Angeles,...,3.0,3.0,3.0,399.0,30,365,0,NaN,NaN,f
1,37014494,Spanish style lower duplex near Beverly Hills,278288178,Ida,22/07/19,NaN,NaN,f,Beverlywood,City of Los Angeles,...,NaN,2.0,NaN,NaN,30,0,0,NaN,NaN,f
2,1024835174766068422,Charming Beverly Hills Home,513813179,Tiana,08/05/23,within a day,0.60,f,Beverly Hills,Other Cities,...,3.0,3.0,3.0,434.0,30,267,0,NaN,NaN,f
3,850744632375448560,Tianpu's warm room with bathroom,432956623,Dan,22/11/21,a few days or more,0.20,f,Temple City,Other Cities,...,1.0,1.0,1.0,49.0,1,364,1,3.00,NaN,f
4,953950676345326970,"Santa Monica apt, free parking, steps to the b...",528669205,Farkhat,29/07/23,within an hour,1.00,t,Santa Monica,Other Cities,...,1.0,0.0,1.0,231.0,5,193,44,4.93,Exempt,t
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
45528,892894292387453414,"Cozy 1 Bed, 2 Bath apartment",111223499,Eric,42748.0,NaN,NaN,f,Marina del Rey,Unincorporated Areas,...,NaN,1.0,NaN,NaN,1,0,0,NaN,NaN,f
45529,944430003646575559,DTLA Loft | Industrial | Central,528133129,Michael,45133.0,NaN,NaN,f,Downtown,City of Los Angeles,...,NaN,NaN,NaN,NaN,30,89,0,NaN,NaN,f
45530,746345243817423719,"Long Beach, Rustic Suite 3 Beds, 1 Bath, 2 Rooms",484471086,Cabana,44855.0,within an hour,1.00,f,Long Beach,Other Cities,...,NaN,2.0,NaN,NaN,31,244,0,NaN,Exempt,t
45531,32943553,Charming Craftsman Bungalow w/ Outdoor Sauna,8110883,Christine,41498.0,within an hour,1.00,t,Jefferson Park,City of Los Angeles,...,1.0,0.0,1.0,116.0,2,141,212,4.84,HSR19-000881,t
45532,37853838,"Views, big backyard, central LA!",8401300,Maite,41511.0,a few days or more,0.11,f,View Park-Windsor Hills,Unincorporated Areas,...,2.5,3.0,4.0,338.0,1,361,12,4.83,NaN,f

In [10]:
la_data.head()

,id,name,host_id,host_name,host_since,host_response_time,host_response_rate,host_is_superhost,neighbourhood_cleansed,neighbourhood_group_cleansed,...,bathrooms,bedrooms,beds,price,minimum_nights,availability_365,number_of_reviews,review_scores_rating,license,instant_bookable
0,670339032744709144,Westwood lovely three bedrooms three bathrooms,4780152,Moon,20/01/13,within a few hours,0.96,f,West Los Angeles,City of Los Angeles,...,3.0,3.0,3.0,399.0,30,365,0,NaN,NaN,f
1,37014494,Spanish style lower duplex near Beverly Hills,278288178,Ida,22/07/19,NaN,NaN,f,Beverlywood,City of Los Angeles,...,NaN,2.0,NaN,NaN,30,0,0,NaN,NaN,f
2,1024835174766068422,Charming Beverly Hills Home,513813179,Tiana,08/05/23,within a day,0.60,f,Beverly Hills,Other Cities,...,3.0,3.0,3.0,434.0,30,267,0,NaN,NaN,f
3,850744632375448560,Tianpu's warm room with bathroom,432956623,Dan,22/11/21,a few days or more,0.20,f,Temple City,Other Cities,...,1.0,1.0,1.0,49.0,1,364,1,3.00,NaN,f
4,953950676345326970,"Santa Monica apt, free parking, steps to the b...",528669205,Farkhat,29/07/23,within an hour,1.00,t,Santa Monica,Other Cities,...,1.0,0.0,1.0,231.0,5,193,44,4.93,Exempt,t

In [11]:
la_data.head(3)

,id,name,host_id,host_name,host_since,host_response_time,host_response_rate,host_is_superhost,neighbourhood_cleansed,neighbourhood_group_cleansed,...,bathrooms,bedrooms,beds,price,minimum_nights,availability_365,number_of_reviews,review_scores_rating,license,instant_bookable
0,670339032744709144,Westwood lovely three bedrooms three bathrooms,4780152,Moon,20/01/13,within a few hours,0.96,f,West Los Angeles,City of Los Angeles,...,3.0,3.0,3.0,399.0,30,365,0,NaN,NaN,f
1,37014494,Spanish style lower duplex near Beverly Hills,278288178,Ida,22/07/19,NaN,NaN,f,Beverlywood,City of Los Angeles,...,NaN,2.0,NaN,NaN,30,0,0,NaN,NaN,f
2,1024835174766068422,Charming Beverly Hills Home,513813179,Tiana,08/05/23,within a day,0.60,f,Beverly Hills,Other Cities,...,3.0,3.0,3.0,434.0,30,267,0,NaN,NaN,f

In [ ]:
la_data['host_name']

0             Moon
1              Ida
2            Tiana
3              Dan
4          Farkhat
           ...
45528         Eric
45529      Michael
45530       Cabana
45531    Christine
45532        Maite
Name: host_name, Length: 45533, dtype: object

In [17]:
#Picking row 
la_data.loc[0]

id                                                          670339032744709144
name                            Westwood lovely three bedrooms three bathrooms
host_id                                                                4780152
host_name                                                                 Moon
host_since                                                            20/01/13
host_response_time                                          within a few hours
host_response_rate                                                        0.96
host_is_superhost                                                            f
neighbourhood_cleansed                                        West Los Angeles
neighbourhood_group_cleansed                               City of Los Angeles
latitude                                                              34.04966
longitude                                                           -118.43555
property_type                                                     Entire condo
room_type                                                      Entire home/apt
accommodates                                                                 6
bathrooms                                                                  3.0
bedrooms                                                                   3.0
beds                                                                       3.0
price                                                                    399.0
minimum_nights                                                              30
availability_365                                                           365
number_of_reviews                                                            0
review_scores_rating                                                       NaN
license                                                                    NaN
instant_bookable                                                             f
Name: 0, dtype: object

In [16]:
#Picking column
la_data.iloc[0]

id                                                          670339032744709144
name                            Westwood lovely three bedrooms three bathrooms
host_id                                                                4780152
host_name                                                                 Moon
host_since                                                            20/01/13
host_response_time                                          within a few hours
host_response_rate                                                        0.96
host_is_superhost                                                            f
neighbourhood_cleansed                                        West Los Angeles
neighbourhood_group_cleansed                               City of Los Angeles
latitude                                                              34.04966
longitude                                                           -118.43555
property_type                                                     Entire condo
room_type                                                      Entire home/apt
accommodates                                                                 6
bathrooms                                                                  3.0
bedrooms                                                                   3.0
beds                                                                       3.0
price                                                                    399.0
minimum_nights                                                              30
availability_365                                                           365
number_of_reviews                                                            0
review_scores_rating                                                       NaN
license                                                                    NaN
instant_bookable                                                             f
Name: 0, dtype: object

In [18]:
data2.loc[0]

Name           Namir
Age               21
Location    New York
Name: 0, dtype: object

In [19]:
data2.iloc[0]

Name           Namir
Age               21
Location    New York
Name: 0, dtype: object

In [20]:
data2.loc[3]

Name          Stark
Age              27
Location    Chicago
Name: 3, dtype: object

In [21]:
data2.iloc[3]

Name          Stark
Age              27
Location    Chicago
Name: 3, dtype: object

In [22]:
data2.loc[0][0]

C:\Users\namir\AppData\Local\Temp\ipykernel_8100\1088316015.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  data2.loc[0][0]

'Namir'

In [23]:
la_data['host_name']

0             Moon
1              Ida
2            Tiana
3              Dan
4          Farkhat
           ...
45528         Eric
45529      Michael
45530       Cabana
45531    Christine
45532        Maite
Name: host_name, Length: 45533, dtype: object

In [24]:
la_data.at[1,'name']

'Spanish style lower duplex near Beverly Hills'

In [26]:
#other way to access from row column
la_data.iat[1,3]

'Ida'

In [31]:
la_data.loc[1][3]

C:\Users\namir\AppData\Local\Temp\ipykernel_8100\543590287.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  la_data.loc[1][3]

'Ida'

Data manipulation with DataFrame

In [32]:
data2

    Name  Age     Location
0  Namir   21     New York
1    jon   30  Los Angeles
2   John   25      Chicago
3  Stark   27      Chicago
4   Dron   25   New Jersey

In [34]:
data2['salary'] = [100000,200000,43000,50000,100000]
data2

    Name  Age     Location  salary
0  Namir   21     New York  100000
1    jon   30  Los Angeles  200000
2   John   25      Chicago   43000
3  Stark   27      Chicago   50000
4   Dron   25   New Jersey  100000

In [37]:
data2.drop('salary',axis = 1)  #axis = 1 since it is a column and for column it is 1 and for row it is 0

    Name  Age     Location
0  Namir   21     New York
1    jon   30  Los Angeles
2   John   25      Chicago
3  Stark   27      Chicago
4   Dron   25   New Jersey

In [38]:
data2

    Name  Age     Location  salary
0  Namir   21     New York  100000
1    jon   30  Los Angeles  200000
2   John   25      Chicago   43000
3  Stark   27      Chicago   50000
4   Dron   25   New Jersey  100000

In [ ]:
data2.drop('salary',axis = 1, inplace = True)

In [42]:
data2

    Name  Age     Location
0  Namir   21     New York
1    jon   30  Los Angeles
2   John   25      Chicago
3  Stark   27      Chicago
4   Dron   25   New Jersey

In [43]:
data2['Age'] = data2['Age']+1

In [44]:
data2

    Name  Age     Location
0  Namir   22     New York
1    jon   31  Los Angeles
2   John   26      Chicago
3  Stark   28      Chicago
4   Dron   26   New Jersey

In [45]:
data2.drop(1,axis = 0,inplace=True)

In [46]:
data2

    Name  Age    Location
0  Namir   22    New York
2   John   26     Chicago
3  Stark   28     Chicago
4   Dron   26  New Jersey

In [48]:
data2.describe()

             Age
count   4.000000
mean   25.500000
std     2.516611
min    22.000000
25%    25.000000
50%    26.000000
75%    26.500000
max    28.000000

In [49]:
la_data.describe()

,id,host_id,host_response_rate,latitude,longitude,accommodates,bathrooms,bedrooms,beds,price,minimum_nights,availability_365,number_of_reviews,review_scores_rating
count,4.553300e+04,4.553300e+04,35445.000000,45533.000000,45533.000000,45533.000000,37294.000000,42494.000000,37199.000000,37296.000000,45533.000000,45533.000000,45533.000000,33387.000000
mean,5.208941e+17,1.950473e+08,0.952010,34.055308,-118.312743,4.019876,1.649434,1.786817,2.255786,289.377762,17.858520,195.093449,36.658929,4.778747
std,4.976570e+17,1.899825e+08,0.168667,0.141394,0.172210,2.861610,1.218398,1.339151,1.811313,715.366985,28.836101,133.394403,80.548528,0.415048
min,1.090000e+02,5.210000e+02,0.000000,33.338360,-118.917134,1.000000,0.000000,0.000000,0.000000,5.000000,1.000000,0.000000,0.000000,0.000000
25%,3.319485e+07,2.632699e+07,1.000000,33.998590,-118.413090,2.000000,1.000000,1.000000,1.000000,98.000000,2.000000,75.000000,0.000000,4.730000
50%,6.363561e+17,1.165631e+08,1.000000,34.060625,-118.343391,3.000000,1.000000,1.000000,2.000000,155.000000,14.000000,202.000000,6.000000,4.900000
75%,1.006571e+18,3.712316e+08,1.000000,34.108160,-118.233737,6.000000,2.000000,2.000000,3.000000,260.000000,30.000000,335.000000,34.000000,5.000000
max,1.238217e+18,5.997497e+08,1.000000,34.811183,-117.653352,16.000000,50.000000,50.000000,50.000000,56425.000000,1124.000000,365.000000,3024.000000,5.000000